Terraform v0.14.5 .
in provider file below is the content 
```
provider "aws" {
  region = "eu-west-1"
}```
I am running this command `terraform import aws_route53_zone.this Z0164055395PYJGV5XHX1`

Below is output of `terraform plan`

```
 terraform plan
aws_route53_zone.this: Refreshing state... [id=Z0164055395PYJGV5XHX1]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_zone.this will be destroyed
  - resource "aws_route53_zone" "this" {
      - comment      = "for testing" -> null
      - id           = "Z0164055395PYJGV5XHX1" -> null
      - name         = "test.corp.amdocs.aws" -> null
      - name_servers = [
          - "ns-0.awsdns-00.com.",
          - "ns-1024.awsdns-00.org.",
          - "ns-1536.awsdns-00.co.uk.",
          - "ns-512.awsdns-00.net.",
        ] -> null
      - tags         = {} -> null
      - tags_all     = {} -> null
      - zone_id      = "Z0164055395PYJGV5XHX1" -> null

      - vpc {
          - vpc_id     = "vpc-0100c890079a1a7fe" -> null
          - vpc_region = "eu-west-1" -> null
        }
      - vpc {
          - vpc_id     = "vpc-bd6a58d9" -> null
          - vpc_region = "eu-west-1" -> null
        }
    }

  # null_resource.route53-validation will be created
  + resource "null_resource" "route53-validation" {
      + id = (known after apply)
    }

  # module.zones.aws_route53_zone.this["test.corp.amdocs.aws"] will be created
  + resource "aws_route53_zone" "this" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "test.corp.amdocs.aws"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = "vpc-0100c890079a1a7fe"
          + vpc_region = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + route53_zone_name_servers = {
      + test.corp.amdocs.aws = (known after apply)
    }
  + route53_zone_zone_id      = {
      + test.corp.amdocs.aws = (known after apply)
    }

------------------------------------------------------------------------
```

and in variables.tf

```
# AWS
variable "region" {
  type        = string
  default     = ""
  description = "The AWS region"
}
# AWS Route53

variable "hosted_zone_name" {
  description = "The name of the hosted zone"
  type        = string
}

variable "vpc_id" {
  description = "The VPC ID"
  type        = string
}

variable "common_tags" {
  type        = map
  default     = {}
  description = "A mapping of tags to assign to the resource"
}

variable "records" {
  description = "List of maps of DNS records"
  type        = any
  default     = []
}
```